# !/usr/bin/python
# -*- coding: utf-8 -*-

u"""
Астра - пульт для запуска, воспроизведения и управления воспроизведением
видо-файлов с компьютера...
"""

from server.py import SocketServer # Класс-сервера


class AstraApp(object):
    u"""Базовый класс приложения"""

    def run():
        u"""Запуск приложения"""

        # 1. Запустить сокет и показать на экране код подключения
        #
        # 2. Отправить клиенту список медиа-файлов
        #
        # 3. Получив имя файла запустить проигрывание и начать отслеживание
        # процесса проигрывания и реакцию на команды клиента
        #
        # 4. Завершить воспроизведение и отчитаться об этом клиенту

        pass
